# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

# coins = input("Input coins: ")
# up ='1'

# upcount = 0
# downcount = 0

# for i in coins:
#     if i == up:
#         upcount +=1
#     else:
#         downcount +=1
# if upcount > downcount:
#     print(f'count of coins: {downcount}')
# elif downcount > upcount:
#     print(f'count of coins: {upcount}')
# else:
#     print(f'count of coins: {downcount}') 


